\n"mininav&#95;tags":/home/www/zendstudio/dokuwiki/bin/lib/exe/fetch.php?id=&media=mininav_tags

bc(code). <txp:older>


The "older":/home/www/zendstudio/dokuwiki/bin/doku.php?id=older tag is both a _single_ tag and a _container_ tag. Should be used in a page after an article tag.

Textpattern will replace this tag with a link to the next list of articles in the sort order. The container tags wrap the text or tag assigned to the link. As a single tag it outputs the URL for the previous list page.

An article list consists of the assigned number of articles set by the article tag. If there are no articles available having *Older* status (articles ranked lower, or later, in the present sort criteria than the present bottom of page article)

bc(code). <txp:older>


will not display unless the

bc(code). showalways


attribute is set to

bc(code). 1


. It is normally seen used in tandem with "newer":/home/www/zendstudio/dokuwiki/bin/doku.php?id=newer.

Given a

bc(code). <txp:article limit="5" />


tag on the page in question

bc(code). <txp:older>


will page down five articles at a time from the most recent post back in time to the oldest.

*Note:* This tag is context-sensitive, meaning it will only grab content from the section or category being viewed.

h3(sectionedit1#attributes). Attributes

Tag will accept the following attributes (*case-sensitive*):

*"escape":/home/www/zendstudio/dokuwiki/bin/doku.php?id=attributes_cross-reference#escape=“html”*
 Escape HTML entities such as

bc(code). <


,

bc(code). >


and

bc(code). &


. Values:

bc(code). html


or unset. Default:

bc(code). html


*"showalways":/home/www/zendstudio/dokuwiki/bin/doku.php?id=attributes_cross-reference#showalways=“boolean”*
 Show wrapped value even when no older page exists. Values:

bc(code). 0


(no) or

bc(code). 1


(yes). Default:

bc(code). 0


*"title":/home/www/zendstudio/dokuwiki/bin/doku.php?id=attributes_cross-reference#title=“text”*
 HTML title attribute. Default: unset.

h3(sectionedit2#examples). Examples

h4(#example_1container_taglink_with_text). Example 1: Container tag: link with text

bc(code). <txp:older>Older</txp:older>


h4(#example_2single_taglink_with_image). Example 2: Single tag: link with image

bc(code). <nowiki><a href="<txp:older />"><txp:image name="left-arrow.gif" /></a></nowiki>


h4(#example_3container_taglink_with_image). Example 3: Container tag: link with image

bc(code). <txp:older><txp:image name="left-arrow.gif" /></txp:older>


The difference between examples 2 and 3 is that the tags in example 2 will display the image even if there are no older articles, those used in example 3 won't.

Other tags used: "image":/home/www/zendstudio/dokuwiki/bin/doku.php?id=image

h3(sectionedit3#genealogy). Genealogy

h4(#version_430). Version 4.3.0

<ul>
<li>bc(code). title


<p>attribute reintroduced after being accidentally removed</p></li>
<li><p>Added</p>
bc(code). escape


<p>attribute</p></li>
</ul>

