\n"mininav&#95;tags":/home/www/zendstudio/dokuwiki/bin/lib/exe/fetch.php?id=&media=mininav_tags

bc(code). <txp:section>


The "section":/home/www/zendstudio/dokuwiki/bin/doku.php?id=section tag can be used as either a _single_ tag or _container_ tag. It will display information about the section as defined by either the

bc(code). name


attribute, the section currently being viewed, or the section of the article being displayed (if used within an "article form":/home/www/zendstudio/dokuwiki/bin/doku.php?id=forms_explained, or an "if&#95;individual&#95;article":/home/www/zendstudio/dokuwiki/bin/doku.php?id=if_individual_article conditional tag).

When used as a containing tag, it will turn the contents into a link to that section. Otherwise, it will return plain text.

h3(sectionedit1#attributes). Attributes

Tag will accept the following attributes (*case-sensitive*):

*"class":/home/www/zendstudio/dokuwiki/bin/doku.php?id=attributes_cross-reference#class=“class name”*
 CSS class name to apply to the

bc(code). wraptag


. If no wraptag is supplied (and

bc(code). link="1"


), the class is applied to the anchor instead. Default: unset. *"link":/home/www/zendstudio/dokuwiki/bin/doku.php?id=attributes_cross-reference#link=“boolean” (works only in the _single_ tag)*
 Display as plain text or a link. Values:

bc(code). 0


or

bc(code). 1


Default:

bc(code). 0


(plain text) *"name":/home/www/zendstudio/dokuwiki/bin/doku.php?id=attributes_cross-reference#name=“section name”*
 Display the named section. Default: unset (display the current section) *"title":/home/www/zendstudio/dokuwiki/bin/doku.php?id=attributes_cross-reference#title=“boolean”*
 Display either the section name or its title. Values:

bc(code). 0


or

bc(code). 1


Default:

bc(code). 0


(name) *"url":/home/www/zendstudio/dokuwiki/bin/doku.php?id=attributes_cross-reference#url=“boolean”*
 Display plain URL or full link. Values:

bc(code). 0


or

bc(code). 1


Default:

bc(code). 0


(display title or full link, depending on

bc(code). link


) *"wraptag":/home/www/zendstudio/dokuwiki/bin/doku.php?id=attributes_cross-reference#wraptag=“tag”*
 HTML tag name to be used as the wraptag, without brackets. Default: unset.

h3(sectionedit2#examples). Examples

h4(#example_1display_the_current_section_name). Example 1: Display the current section name

bc(code). <txp:section />


h4(#example_2display_hyperlinked_section_title). Example 2: Display hyperlinked section title

bc(code). <txp:section link="1" title="1" />


*What this does...*
 In an article form, it displays the article's section title as a hyperlink to the section home page. Otherwise, it displays the title of the section currently being viewed as a hyperlink to the section home page.

h4(#example_3display_a_link_to_a_specified_section). Example 3: Display a link to a specified section

bc(code). <txp:section link="1" title="1" wraptag="p" name="archive" />


*What this does...*
 It displays a hyperlink to the 'archive' section home page, wrapped in

bc(code). <nowiki><p></nowiki>


tags, using the section's title as link text.

h4(#example_4container_tag_example). Example 4: Container tag example

bc(code). <txp:section name="archive">My Archive</txp:section>


*What this does...*
 It displays the text “My Archive” as a hyperlink to the 'archive' section home page. HTML output for clean URLs:

bc(code). <a href="http://yourdomain.tld/archive/>My Archive</a>


and for messy URLs:

bc(code). <a href="http://yourdomain.tld/index.php?s=archive">My Archive</a>


h4(#example_5single_tag_example). Example 5: Single tag example

bc(code). <a href="<txp:section name="about" url="1" />"><txp:section name="about" title="1" /></a>


*What this does...*
 It displays the section title “About” as a hyperlink to the 'about' section home page. HTML output for clean URLs:

bc(code). <a href="http://yourdomain.tld/about/">About</a>


and for messy URLs:

bc(code). <a href="http://yourdomain.tld/index.php?s=about">About</a>


h3(sectionedit3#genealogy). Genealogy

h4(#version_407). Version 4.0.7

<ul>
<li><p>Applies</p>
bc(code). class


<p>attribute to the</p>
bc(code). <a>


<p>element when</p>
bc(code). wraptag


<p>is empty.</p></li>
<li><p>New attribute,</p>
bc(code). url


<p>to output URL only.</p></li>
</ul>

